roam/go-basics.org
:PROPERTIES:
:ID: f8bdd294-b1ec-48c6-b997-39246c63d481
:CREATED: [2026-04-17 Fri 23:30]
:END:
#+title: GO Basics

* Core Basics

** Variables

#+begin_src go
package main

import "fmt"

func main() {
    // Explicit type
    var name string = "Alice"
    var age int = 25
    var balance float64 = 100.50
    var active bool = true
    
    // Type inference (Go figures it out)
    var city = "New York"  // string
    var count = 42         // int
    
    // Short declaration (inside functions only)
    message := "Hello"
    x := 10
    
    // Short declaration NOT allowed at package level
    // name := "Bob"  // ERROR outside function
    
    fmt.Println(name, age, city, message)
}
#+end_src


- Go is *strongly typed*: once a variable is declared, its type is fixed
- Zero values: strings =""=, ints =0=, bools =false=, pointers =nil=, slice =nil=

  
** Constants

Constants must be known at compile time. You cannot assign values returned from functions or computed at runtime.

#+begin_src go
// Constants (values known at compile time)
const Pi = 3.14159
const MaxConnections int = 100

// Group constants
const (
    Red    = "red"
    Green  = "green"
    Blue   = "blue"
)

// Iota (auto-incrementing)
const (
    Small  = iota  // 0
    Medium         // 1
    Large          // 2
)

// Constants can't be reassigned
// Pi = 3.15  // ERROR

#+end_src

** Primitive Types

#+begin_src go
  var a int = 42           // signed, platform-dependent size
  var g float64 = 3.14159  // Preferred for precision
  var s string = "hello"
  var active bool = true

  // Printing types
  fmt.Printf("%T\n", 42)        // int
  fmt.Printf("%T\n", 3.14)      // float64
  fmt.Printf("%T\n", "hello")   // string

#+end_src

