docs/go-basics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-05-03 Sun 19:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GO Basics</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/zeroorone/style.css" type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<meta name='theme-color' id='theme-color-meta' content='#f5f5f5'>
   <header>
    <nav class='breadcrumb'>
      <a href='/zeroorone/index.html'>Home</a>
      <span class='breadcrumb-sep'>/</span>
      <span class='breadcrumb-current'>GO Basics</span>
    </nav>
    <div class='controls'>
      <button class='sidebar-toggle' title='Search'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M18.319 14.4326C20.7628 11.2941 20.542 6.75347 17.6569 3.86829C14.5327 0.744098 9.46734 0.744098 6.34315 3.86829C3.21895 6.99249 3.21895 12.0578 6.34315 15.182C9.22833 18.0672 13.769 18.2879 16.9075 15.8442C16.921 15.8595 16.9351 15.8745 16.9497 15.8891L21.1924 20.1317C21.5829 20.5223 22.2161 20.5223 22.6066 20.1317C22.9971 19.7412 22.9971 19.1081 22.6066 18.7175L18.364 14.4749C18.3493 14.4603 18.3343 14.4462 18.319 14.4326ZM16.2426 5.28251C18.5858 7.62565 18.5858 11.4246 16.2426 13.7678C13.8995 16.1109 10.1005 16.1109 7.75736 13.7678C5.41421 11.4246 5.41421 7.62565 7.75736 5.28251C10.1005 2.93936 13.8995 2.93936 16.2426 5.28251Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='theme-toggle' title='Toggle Theme'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8V16Z' fill='currentColor'/>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M12 2C6.47715 2 2 6.47715 2 12C2 17.5228 6.47715 22 12 22C17.5228 22 22 17.5228 22 12C22 6.47715 17.5228 2 12 2ZM12 4V8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16V20C16.4183 20 20 16.4183 20 12C20 7.58172 16.4183 4 12 4Z' fill='currentColor'/>
        </svg>
      </button>

      <button class='toc-toggle' title='Table of Contents'>
        <svg width='20' height='20' viewBox='0 0 24 24' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path d='M2 6C2 5.44772 2.44772 5 3 5H21C21.5523 5 22 5.44772 22 6C22 6.55228 21.5523 7 21 7H3C2.44772 7 2 6.55228 2 6Z' fill='currentColor'/>
          <path d='M2 12.0322C2 11.4799 2.44772 11.0322 3 11.0322H21C21.5523 11.0322 22 11.4799 22 12.0322C22 12.5845 21.5523 13.0322 21 13.0322H3C2.44772 13.0322 2 12.5845 2 12.0322Z' fill='currentColor'/>
          <path d='M3 17.0645C2.44772 17.0645 2 17.5122 2 18.0645C2 18.6167 2.44772 19.0645 3 19.0645H21C21.5523 19.0645 22 18.6167 22 18.0645C22 17.5122 21.5523 17.0645 21 17.0645H3Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
  </header>

  <aside id='left-sidebar'>
    <div class='sidebar-header'>
      <h3>Search & Tags</h3>
      <button class='sidebar-close' title='Close'>
        <svg width='20' height='20' viewBox='0 0 15 15' fill='none' xmlns='http://www.w3.org/2000/svg'>
          <path fill-rule='evenodd' clip-rule='evenodd' d='M11.7816 4.03157C12.0062 3.80702 12.0062 3.44295 11.7816 3.2184C11.5571 2.99385 11.193 2.99385 10.9685 3.2184L7.50005 6.68682L4.03164 3.2184C3.80708 2.99385 3.44301 2.99385 3.21846 3.2184C2.99391 3.44295 2.99391 3.80702 3.21846 4.03157L6.68688 7.49999L3.21846 10.9684C2.99391 11.193 2.99391 11.557 3.21846 11.7816C3.44301 12.0061 3.80708 12.0061 4.03164 11.7816L7.50005 8.31316L10.9685 11.7816C11.193 12.0061 11.5571 12.0061 11.7816 11.7816C12.0062 11.557 12.0062 11.193 11.7816 10.9684L8.31322 7.49999L11.7816 4.03157Z' fill='currentColor'/>
        </svg>
      </button>
    </div>
    <div class='search-container'>
      <input type='text' id='sidebar-search' placeholder='Search full content or #tags...' autocomplete='off'>
    </div>
    <div id='sidebar-tags' class='tag-cloud'></div>
    <ul id='sidebar-results'></ul>
  </aside>
</div>
<div id="content" class="content">
<h1 class="title">GO Basics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb49aea8">Core Basics</a>
<ul>
<li><a href="#orgbd1d2a1">Variables</a></li>
<li><a href="#orgb59c9b3">Constants</a></li>
<li><a href="#org33895de">Primitive Types</a></li>
<li><a href="#org4076bb5">Type Conversion (Explicit)</a></li>
<li><a href="#org9774085">Pointers</a></li>
</ul>
</li>
<li><a href="#orgb758209">Control Flow</a>
<ul>
<li><a href="#org3bd0ce9">If/Else</a></li>
<li><a href="#orgb1ea90e">For Loops</a></li>
<li><a href="#org02f1109">Range Loop</a></li>
<li><a href="#org0e5f322">Switch</a></li>
</ul>
</li>
<li><a href="#orgd1b3b41">Functions</a></li>
<li><a href="#org4a0eead">Error Handling</a>
<ul>
<li><a href="#org061cc0f">Defer</a></li>
</ul>
</li>
<li><a href="#org6107ab8">Data Structures</a>
<ul>
<li><a href="#org0f81b46">Arrays &amp; Slices</a></li>
<li><a href="#orgf539c23">Maps</a></li>
</ul>
</li>
<li><a href="#org327b49c">Formatting and Output</a>
<ul>
<li><a href="#org0677587">String Manipulation</a></li>
<li><a href="#orgd1196ac">Printing</a></li>
<li><a href="#org3c88c97">Formatting Strings</a>
<ul>
<li>
<ul>
<li><a href="#org5e00aa0">Printing Structs</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc324cc5">Input and CLI</a>
<ul>
<li><a href="#org44f863f">Using fmt</a></li>
<li><a href="#orgf10e220">Quick stdin read</a></li>
<li><a href="#org0777aac">String to Int</a></li>
<li><a href="#org78813eb">Command-line Arguments</a></li>
</ul>
</li>
<li><a href="#orgee39bdc">File I/O</a>
<ul>
<li><a href="#orgdb7a18d">Reading from file</a></li>
<li><a href="#org03e05f0">Read entire file at once</a></li>
<li><a href="#orgda57442">Read line by line from a file</a></li>
<li><a href="#org11f357d">Writing to file</a></li>
<li><a href="#org8122976">Append to file</a></li>
<li><a href="#org36e6be3">Buffered Write</a></li>
</ul>
</li>
<li><a href="#org8d2a0c6">JSON</a></li>
<li><a href="#org917b881">Running external commands</a></li>
<li><a href="#org682abc8">Some Standard Library Packages</a>
<ul>
<li><a href="#org16f915f">time</a></li>
<li><a href="#org3e0f95a">filepath</a></li>
<li><a href="#orga4fbecf">net/http (Quick HTTP server)</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb49aea8" class="outline-2">
<h2 id="orgb49aea8">Core Basics</h2>
<div class="outline-text-2" id="text-orgb49aea8">
</div>
<div id="outline-container-orgbd1d2a1" class="outline-3">
<h3 id="orgbd1d2a1">Variables</h3>
<div class="outline-text-3" id="text-orgbd1d2a1">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> <span class="org-string">"fmt"</span>

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-comment-delimiter">// </span><span class="org-comment">Explicit type
</span>    <span class="org-keyword">var</span> <span class="org-variable-name">name</span> <span class="org-type">string</span> = <span class="org-string">"Alice"</span>
    <span class="org-keyword">var</span> <span class="org-variable-name">age</span> <span class="org-type">int</span> = 25
    <span class="org-keyword">var</span> <span class="org-variable-name">balance</span> <span class="org-type">float64</span> = 100.50
    <span class="org-keyword">var</span> <span class="org-variable-name">active</span> <span class="org-type">bool</span> = <span class="org-constant">true</span>

    <span class="org-comment-delimiter">// </span><span class="org-comment">Type inference (Go figures it out)
</span>    <span class="org-keyword">var</span> <span class="org-variable-name">city</span> = <span class="org-string">"New York"</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">string
</span>    <span class="org-keyword">var</span> <span class="org-variable-name">count</span> = 42         <span class="org-comment-delimiter">// </span><span class="org-comment">int
</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Short declaration (inside functions only)
</span>    <span class="org-variable-name">message</span> := <span class="org-string">"Hello"</span>
    <span class="org-variable-name">x</span> := 10

    <span class="org-comment-delimiter">// </span><span class="org-comment">Short declaration NOT allowed at package level
</span>    <span class="org-comment-delimiter">// </span><span class="org-comment">name := "Bob"  // ERROR outside function
</span>
    fmt.<span class="org-function-name">Println</span>(name, age, city, message)
}
</pre>
</div>


<ul class="org-ul">
<li>Go is <b>strongly typed</b>: once a variable is declared, its type is fixed</li>
<li>Zero values: strings <code>""</code>, ints <code>0</code>, bools <code>false</code>, pointers <code>nil</code>, slice <code>nil</code></li>
</ul>
</div>
</div>
<div id="outline-container-orgb59c9b3" class="outline-3">
<h3 id="orgb59c9b3">Constants</h3>
<div class="outline-text-3" id="text-orgb59c9b3">
<p>
Constants must be known at compile time. You cannot assign values returned from functions or computed at runtime.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Constants (values known at compile time)
</span><span class="org-keyword">const</span> <span class="org-constant">Pi</span> = 3.14159
<span class="org-keyword">const</span> <span class="org-constant">MaxConnections</span> <span class="org-type">int</span> = 100

<span class="org-comment-delimiter">// </span><span class="org-comment">Group constants
</span><span class="org-keyword">const</span> (
    <span class="org-constant">Red</span>    = <span class="org-string">"red"</span>
    <span class="org-constant">Green</span>  = <span class="org-string">"green"</span>
    <span class="org-constant">Blue</span>   = <span class="org-string">"blue"</span>
)

<span class="org-comment-delimiter">// </span><span class="org-comment">Iota (auto-incrementing)
</span><span class="org-keyword">const</span> (
    <span class="org-constant">Small</span>  = <span class="org-constant">iota</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">0
</span>    <span class="org-constant">Medium</span>         <span class="org-comment-delimiter">// </span><span class="org-comment">1
</span>    <span class="org-constant">Large</span>          <span class="org-comment-delimiter">// </span><span class="org-comment">2
</span>)

<span class="org-comment-delimiter">// </span><span class="org-comment">Constants can't be reassigned
</span><span class="org-comment-delimiter">// </span><span class="org-comment">Pi = 3.15  // ERROR
</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org33895de" class="outline-3">
<h3 id="org33895de">Primitive Types</h3>
<div class="outline-text-3" id="text-org33895de">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">var</span> <span class="org-variable-name">a</span> <span class="org-type">int</span> = 42           <span class="org-comment-delimiter">// </span><span class="org-comment">signed, platform-dependent size
</span><span class="org-keyword">var</span> <span class="org-variable-name">g</span> <span class="org-type">float64</span> = 3.14159  <span class="org-comment-delimiter">// </span><span class="org-comment">Preferred for precision
</span><span class="org-keyword">var</span> <span class="org-variable-name">s</span> <span class="org-type">string</span> = <span class="org-string">"hello"</span>
<span class="org-keyword">var</span> <span class="org-variable-name">active</span> <span class="org-type">bool</span> = <span class="org-constant">true</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Printing types
</span>fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%T\n"</span>, 42)        <span class="org-comment-delimiter">// </span><span class="org-comment">int
</span>fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%T\n"</span>, 3.14)      <span class="org-comment-delimiter">// </span><span class="org-comment">float64
</span>fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%T\n"</span>, <span class="org-string">"hello"</span>)   <span class="org-comment-delimiter">// </span><span class="org-comment">string
</span>
</pre>
</div>
</div>
</div>
