roam/go-basics.org
** Type Conversion (Explicit)


Go requires Explicit type conversion (no automatic)


#+begin_src go
  var x int = 42
  var y float64 = float64(x)      // Must convert explicitly
  var z int = int(y)

  var s string = "42"
  //  var num int = int(s)            //  Does not compile
num, err := strconv.Atoi(s)
if err != nil {
    fmt.Println("Conversion failed:", err)
}

  var f float64 = 3.14
  var si string = strconv.FormatFloat(f, 'f', 2, 64)  // Convert to string
#+end_src

Strings cannot be converted to numbers using casting; use strconv.

** Pointers

Pointers hold memory addresses. Needed for efficiency (large structs) and modification.

#+begin_src go
x := 10
ptr := &x      // Pointer to x (address)
*ptr = 20      // Dereference: change value at pointer
fmt.Println(x) // 20

// Why: Pass large structs by pointer, modify in functions
type Server struct {
    Host string
    Port int
}

func updatePort(s *Server, port int) {
    s.Port = port  // Auto-dereferenced
}

server := Server{Host: "localhost", Port: 8080}
updatePort(&server, 9000)
fmt.Println(server.Port) // 9000
#+end_src


* Control Flow

** If/Else
You must put the opening braces on the same line as the condition and not on a new line. And =else= and =else if= must start on the same line as the closing braces of =if= statement. 

#+begin_src go
if x > 10 {
    fmt.Println("big")
} else if x > 5 {
    fmt.Println("medium")
} else {
    fmt.Println("small")
}

// If with initialization
if err := doSomething(); err != nil {
    return err
}
// err not accessible here
#+end_src

** For Loops

Go only has =for=, no =while=

#+begin_src go
// Traditional
for i := 0; i < 10; i++ {
    fmt.Println(i)
}

// While-style
for condition {
    // loop
}

// Infinite loop
for {
    // loop forever
    break  // exit
}

// Continue
for i := 0; i < 10; i++ {
    if i%2 == 0 {
        continue  // Skip even numbers
    }
    fmt.Println(i)
}
#+end_src

** Range Loop

Iterate over slices, arrays, maps, strings.

#+begin_src go
// Slice: index and value
nums := []int{10, 20, 30}
for i, val := range nums {
    fmt.Println(i, val)
}

// Ignore index
for _, val := range nums {
    fmt.Println(val)
}

// Ignore value (just indices)
for i := range nums {
    fmt.Println(i)
}

// Map: key and value
env := map[string]string{"PATH": "/usr/bin", "HOME": "/root"}
for key, val := range env {
    fmt.Println(key, "=", val)
}

// String: index and rune (Unicode code point)
for i, char := range "hello" {
    fmt.Printf("%d: %c\n", i, char)
}
#+end_src

** Switch

#+begin_src go
switch day {
case "Monday":
    fmt.Println("Start of week")
case "Friday":
    fmt.Println("TGIF")
default:
    fmt.Println("Midweek")
}

// No condition (like if-else chain)
switch {
case score >= 90:
    grade = "A"
case score >= 80:
    grade = "B"
default:
    grade = "C"
}

// Switch with initialization
switch err := doSomething(); err {
case nil:
    fmt.Println("Success")
default:
    fmt.Println("Error:", err)
}
#+end_src



