docs/go-basics.html
<div id="outline-container-org4076bb5" class="outline-3">
<h3 id="org4076bb5">Type Conversion (Explicit)</h3>
<div class="outline-text-3" id="text-org4076bb5">
<p>
Go requires Explicit type conversion (no automatic)
</p>


<div class="org-src-container">
<pre class="src src-go">  <span class="org-keyword">var</span> <span class="org-variable-name">x</span> <span class="org-type">int</span> = 42
  <span class="org-keyword">var</span> <span class="org-variable-name">y</span> <span class="org-type">float64</span> = <span class="org-function-name">float64</span>(x)      <span class="org-comment-delimiter">// </span><span class="org-comment">Must convert explicitly
</span>  <span class="org-keyword">var</span> <span class="org-variable-name">z</span> <span class="org-type">int</span> = <span class="org-function-name">int</span>(y)

  <span class="org-keyword">var</span> <span class="org-variable-name">s</span> <span class="org-type">string</span> = <span class="org-string">"42"</span>
  <span class="org-comment-delimiter">//  </span><span class="org-comment">var num int = int(s)            //  Does not compile
</span><span class="org-variable-name">num</span>, <span class="org-variable-name">err</span> := strconv.<span class="org-function-name">Atoi</span>(s)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Conversion failed:"</span>, err)
}

  <span class="org-keyword">var</span> <span class="org-variable-name">f</span> <span class="org-type">float64</span> = 3.14
  <span class="org-keyword">var</span> <span class="org-variable-name">si</span> <span class="org-type">string</span> = strconv.<span class="org-function-name">FormatFloat</span>(f, <span class="org-string">'f'</span>, 2, 64)  <span class="org-comment-delimiter">// </span><span class="org-comment">Convert to string</span>
</pre>
</div>

<p>
Strings cannot be converted to numbers using casting; use strconv.
</p>
</div>
</div>
<div id="outline-container-org9774085" class="outline-3">
<h3 id="org9774085">Pointers</h3>
<div class="outline-text-3" id="text-org9774085">
<p>
Pointers hold memory addresses. Needed for efficiency (large structs) and modification.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-variable-name">x</span> := 10
<span class="org-variable-name">ptr</span> := &amp;x      <span class="org-comment-delimiter">// </span><span class="org-comment">Pointer to x (address)
</span>*ptr = 20      <span class="org-comment-delimiter">// </span><span class="org-comment">Dereference: change value at pointer
</span>fmt.<span class="org-function-name">Println</span>(x) <span class="org-comment-delimiter">// </span><span class="org-comment">20
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Why: Pass large structs by pointer, modify in functions
</span><span class="org-keyword">type</span> <span class="org-type">Server</span> <span class="org-keyword">struct</span> {
    Host <span class="org-type">string</span>
    Port <span class="org-type">int</span>
}

<span class="org-keyword">func</span> <span class="org-function-name">updatePort</span>(<span class="org-variable-name">s</span> *<span class="org-type">Server</span>, <span class="org-variable-name">port</span> <span class="org-type">int</span>) {
    s.Port = port  <span class="org-comment-delimiter">// </span><span class="org-comment">Auto-dereferenced
</span>}

<span class="org-variable-name">server</span> := <span class="org-type">Server</span>{<span class="org-constant">Host</span>: <span class="org-string">"localhost"</span>, <span class="org-constant">Port</span>: 8080}
<span class="org-function-name">updatePort</span>(&amp;server, 9000)
fmt.<span class="org-function-name">Println</span>(server.Port) <span class="org-comment-delimiter">// </span><span class="org-comment">9000</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb758209" class="outline-2">
<h2 id="orgb758209">Control Flow</h2>
<div class="outline-text-2" id="text-orgb758209">
</div>
<div id="outline-container-org3bd0ce9" class="outline-3">
<h3 id="org3bd0ce9">If/Else</h3>
<div class="outline-text-3" id="text-org3bd0ce9">
<p>
You must put the opening braces on the same line as the condition and not on a new line. And <code>else</code> and <code>else if</code> must start on the same line as the closing braces of <code>if</code> statement. 
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">if</span> x &gt; 10 {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"big"</span>)
} <span class="org-keyword">else</span> <span class="org-keyword">if</span> x &gt; 5 {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"medium"</span>)
} <span class="org-keyword">else</span> {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"small"</span>)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">If with initialization
</span><span class="org-keyword">if</span> <span class="org-variable-name">err</span> := <span class="org-function-name">doSomething</span>(); err != <span class="org-constant">nil</span> {
    <span class="org-keyword">return</span> err
}
<span class="org-comment-delimiter">// </span><span class="org-comment">err not accessible here</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1ea90e" class="outline-3">
<h3 id="orgb1ea90e">For Loops</h3>
<div class="outline-text-3" id="text-orgb1ea90e">
<p>
Go only has <code>for</code>, no <code>while</code>
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Traditional
</span><span class="org-keyword">for</span> <span class="org-variable-name">i</span> := 0; i &lt; 10; i++ {
    fmt.<span class="org-function-name">Println</span>(i)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">While-style
</span><span class="org-keyword">for</span> condition {
    <span class="org-comment-delimiter">// </span><span class="org-comment">loop
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Infinite loop
</span><span class="org-keyword">for</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">loop forever
</span>    <span class="org-keyword">break</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">exit
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Continue
</span><span class="org-keyword">for</span> <span class="org-variable-name">i</span> := 0; i &lt; 10; i++ {
    <span class="org-keyword">if</span> i%2 == 0 {
        <span class="org-keyword">continue</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Skip even numbers
</span>    }
    fmt.<span class="org-function-name">Println</span>(i)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org02f1109" class="outline-3">
<h3 id="org02f1109">Range Loop</h3>
<div class="outline-text-3" id="text-org02f1109">
<p>
Iterate over slices, arrays, maps, strings.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Slice: index and value
</span><span class="org-variable-name">nums</span> := []<span class="org-type">int</span>{10, 20, 30}
<span class="org-keyword">for</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">val</span> := <span class="org-keyword">range</span> nums {
    fmt.<span class="org-function-name">Println</span>(i, val)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Ignore index
</span><span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">val</span> := <span class="org-keyword">range</span> nums {
    fmt.<span class="org-function-name">Println</span>(val)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Ignore value (just indices)
</span><span class="org-keyword">for</span> <span class="org-variable-name">i</span> := <span class="org-keyword">range</span> nums {
    fmt.<span class="org-function-name">Println</span>(i)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Map: key and value
</span><span class="org-variable-name">env</span> := <span class="org-keyword">map</span>[<span class="org-type">string</span>]<span class="org-type">string</span>{<span class="org-string">"PATH"</span>: <span class="org-string">"/usr/bin"</span>, <span class="org-string">"HOME"</span>: <span class="org-string">"/root"</span>}
<span class="org-keyword">for</span> <span class="org-variable-name">key</span>, <span class="org-variable-name">val</span> := <span class="org-keyword">range</span> env {
    fmt.<span class="org-function-name">Println</span>(key, <span class="org-string">"="</span>, val)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">String: index and rune (Unicode code point)
</span><span class="org-keyword">for</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">char</span> := <span class="org-keyword">range</span> <span class="org-string">"hello"</span> {
    fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%d: %c\n"</span>, i, char)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0e5f322" class="outline-3">
<h3 id="org0e5f322">Switch</h3>
<div class="outline-text-3" id="text-org0e5f322">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">switch</span> day {
<span class="org-keyword">case</span> <span class="org-string">"Monday"</span>:
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Start of week"</span>)
<span class="org-keyword">case</span> <span class="org-string">"Friday"</span>:
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"TGIF"</span>)
<span class="org-keyword">default</span>:
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Midweek"</span>)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">No condition (like if-else chain)
</span><span class="org-keyword">switch</span> {
<span class="org-keyword">case</span> score &gt;= 90:
    grade = <span class="org-string">"A"</span>
<span class="org-keyword">case</span> score &gt;= 80:
    grade = <span class="org-string">"B"</span>
<span class="org-keyword">default</span>:
    grade = <span class="org-string">"C"</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Switch with initialization
</span><span class="org-keyword">switch</span> <span class="org-variable-name">err</span> := <span class="org-function-name">doSomething</span>(); err {
<span class="org-keyword">case</span> <span class="org-constant">nil</span>:
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Success"</span>)
<span class="org-keyword">default</span>:
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Error:"</span>, err)
}
</pre>
</div>
</div>
</div>
</div>
