roam/go-basics.org
* Functions

#+begin_src go
// Basic function
func add(a, b int) int {
    return a + b
}

// Multiple returns (idiomatic Go for error handling)
func divide(a, b int) (int, error) {
    if b == 0 {
        return 0, fmt.Errorf("divide by zero")
    }
    return a / b, nil
}

result, err := divide(10, 2)
if err != nil {
    fmt.Println("Error:", err)
    return
}

// Named return values
func split(sum int) (x, y int) {
    x = sum * 4 / 9
    y = sum - x
    return  // Returns x and y
}

// Variadic functions (variable arguments)
func sum(nums ...int) int {
    total := 0
    for _, n := range nums {
        total += n
    }
    return total
}

sum(1, 2, 3, 4, 5)  // 15
#+end_src

* Error Handling

Standard Go pattern: functions return =(value, error)=

#+begin_src go
// Standard pattern
file, err := os.Open("data.txt")
if err != nil {
    return fmt.Errorf("failed to open: %w", err)  // %w wraps error
}
defer file.Close()

// Quick scripts: log.Fatal prints error and exits
data, err := os.ReadFile("config.json")
if err != nil {
    log.Fatal(err)
}

// Creating errors
err := fmt.Errorf("invalid port: %d", port)
err := errors.New("connection failed")
#+end_src

=log.Fatal= prints the error and exits the program immediately (no defer runs)

** Defer

Defer schedules a function call to run when the surrounding function exits. Used for cleanup.

#+begin_src go
func main() {
    file, _ := os.Open("data.txt")
    defer file.Close()  // Runs when main() exits
    
    // Do stuff with file...
}

// Multiple defers execute in LIFO order (stack)
defer fmt.Println("3")
defer fmt.Println("2")
defer fmt.Println("1")  // Prints: 1, 2, 3
#+end_src

Common uses: closing files, unlocking mutexes, closing connections.

* Data Structures

** Arrays & Slices

#+begin_src go
// Array (fixed size, rarely used)
var arr [3]int = [3]int{1, 2, 3}

// Slice (dynamic, what you'll actually use)
nums := []int{1, 2, 3}
nums = append(nums, 4, 5)

fmt.Println(len(nums))  // 5 (length)
fmt.Println(cap(nums))  // capacity (underlying array size)

// Make slice with capacity
s := make([]int, 0, 10)  // length 0, capacity 10

// Slicing operations
slice := []int{0, 1, 2, 3, 4, 5}
slice[1:4]     // [1 2 3] (index 1 to 3)
slice[:3]      // [0 1 2] (first 3)
slice[3:]      // [3 4 5] (from index 3)

// Copy slice
src := []int{1, 2, 3}
dst := make([]int, len(src))
copy(dst, src)
#+end_src

** Maps

Key-value pairs. Essential for configs, caching, lookups.

#+begin_src go
// Create
env := make(map[string]string)
env := map[string]string{
    "PATH": "/usr/bin",
    "HOME": "/root",
}

// Add/Update
env["USER"] = "admin"

// Check existence
val, ok := env["USER"]
if ok {
    fmt.Println("Found:", val)
}

// Delete
delete(env, "USER")

// Loop over map
for key, val := range env {
    fmt.Println(key, "=", val)
}

// Map of structs
users := make(map[string]User)
users["alice"] = User{Name: "Alice", Age: 30}
#+end_src




* Formatting and Output

