docs/go-basics.html
<div id="outline-container-orgd1b3b41" class="outline-2">
<h2 id="orgd1b3b41">Functions</h2>
<div class="outline-text-2" id="text-orgd1b3b41">
<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Basic function
</span><span class="org-keyword">func</span> <span class="org-function-name">add</span>(<span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> <span class="org-type">int</span>) <span class="org-type">int</span> {
    <span class="org-keyword">return</span> a + b
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Multiple returns (idiomatic Go for error handling)
</span><span class="org-keyword">func</span> <span class="org-function-name">divide</span>(<span class="org-variable-name">a</span>, <span class="org-variable-name">b</span> <span class="org-type">int</span>) (<span class="org-type">int</span>, <span class="org-type">error</span>) {
    <span class="org-keyword">if</span> b == 0 {
        <span class="org-keyword">return</span> 0, fmt.<span class="org-function-name">Errorf</span>(<span class="org-string">"divide by zero"</span>)
    }
    <span class="org-keyword">return</span> a / b, <span class="org-constant">nil</span>
}

<span class="org-variable-name">result</span>, <span class="org-variable-name">err</span> := <span class="org-function-name">divide</span>(10, 2)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Error:"</span>, err)
    <span class="org-keyword">return</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Named return values
</span><span class="org-keyword">func</span> <span class="org-function-name">split</span>(<span class="org-variable-name">sum</span> <span class="org-type">int</span>) (<span class="org-variable-name">x</span>, <span class="org-variable-name">y</span> <span class="org-type">int</span>) {
    x = sum * 4 / 9
    y = sum - x
    <span class="org-keyword">return</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Returns x and y
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Variadic functions (variable arguments)
</span><span class="org-keyword">func</span> <span class="org-function-name">sum</span>(<span class="org-variable-name">nums</span> ...<span class="org-type">int</span>) <span class="org-type">int</span> {
    <span class="org-variable-name">total</span> := 0
    <span class="org-keyword">for</span> <span class="org-variable-name">_</span>, <span class="org-variable-name">n</span> := <span class="org-keyword">range</span> nums {
        total += n
    }
    <span class="org-keyword">return</span> total
}

<span class="org-function-name">sum</span>(1, 2, 3, 4, 5)  <span class="org-comment-delimiter">// </span><span class="org-comment">15</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org4a0eead" class="outline-2">
<h2 id="org4a0eead">Error Handling</h2>
<div class="outline-text-2" id="text-org4a0eead">
<p>
Standard Go pattern: functions return <code>(value, error)</code>
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Standard pattern
</span><span class="org-variable-name">file</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">Open</span>(<span class="org-string">"data.txt"</span>)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    <span class="org-keyword">return</span> fmt.<span class="org-function-name">Errorf</span>(<span class="org-string">"failed to open: %w"</span>, err)  <span class="org-comment-delimiter">// </span><span class="org-comment">%w wraps error
</span>}
<span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()

<span class="org-comment-delimiter">// </span><span class="org-comment">Quick scripts: log.Fatal prints error and exits
</span><span class="org-variable-name">data</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">ReadFile</span>(<span class="org-string">"config.json"</span>)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Creating errors
</span><span class="org-variable-name">err</span> := fmt.<span class="org-function-name">Errorf</span>(<span class="org-string">"invalid port: %d"</span>, port)
<span class="org-variable-name">err</span> := errors.<span class="org-function-name">New</span>(<span class="org-string">"connection failed"</span>)
</pre>
</div>

<p>
<code>log.Fatal</code> prints the error and exits the program immediately (no defer runs)
</p>
</div>
<div id="outline-container-org061cc0f" class="outline-3">
<h3 id="org061cc0f">Defer</h3>
<div class="outline-text-3" id="text-org061cc0f">
<p>
Defer schedules a function call to run when the surrounding function exits. Used for cleanup.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
    <span class="org-variable-name">file</span>, <span class="org-variable-name">_</span> := os.<span class="org-function-name">Open</span>(<span class="org-string">"data.txt"</span>)
    <span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()  <span class="org-comment-delimiter">// </span><span class="org-comment">Runs when main() exits
</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">Do stuff with file...
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Multiple defers execute in LIFO order (stack)
</span><span class="org-keyword">defer</span> fmt.<span class="org-function-name">Println</span>(<span class="org-string">"3"</span>)
<span class="org-keyword">defer</span> fmt.<span class="org-function-name">Println</span>(<span class="org-string">"2"</span>)
<span class="org-keyword">defer</span> fmt.<span class="org-function-name">Println</span>(<span class="org-string">"1"</span>)  <span class="org-comment-delimiter">// </span><span class="org-comment">Prints: 1, 2, 3</span>
</pre>
</div>

<p>
Common uses: closing files, unlocking mutexes, closing connections.
</p>
</div>
</div>
</div>
<div id="outline-container-org6107ab8" class="outline-2">
<h2 id="org6107ab8">Data Structures</h2>
<div class="outline-text-2" id="text-org6107ab8">
</div>
<div id="outline-container-org0f81b46" class="outline-3">
<h3 id="org0f81b46">Arrays &amp; Slices</h3>
<div class="outline-text-3" id="text-org0f81b46">
<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Array (fixed size, rarely used)
</span><span class="org-keyword">var</span> <span class="org-variable-name">arr</span> [3]<span class="org-type">int</span> = [3]<span class="org-type">int</span>{1, 2, 3}

<span class="org-comment-delimiter">// </span><span class="org-comment">Slice (dynamic, what you'll actually use)
</span><span class="org-variable-name">nums</span> := []<span class="org-type">int</span>{1, 2, 3}
nums = <span class="org-builtin">append</span>(nums, 4, 5)

fmt.<span class="org-function-name">Println</span>(<span class="org-builtin">len</span>(nums))  <span class="org-comment-delimiter">// </span><span class="org-comment">5 (length)
</span>fmt.<span class="org-function-name">Println</span>(<span class="org-builtin">cap</span>(nums))  <span class="org-comment-delimiter">// </span><span class="org-comment">capacity (underlying array size)
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Make slice with capacity
</span><span class="org-variable-name">s</span> := <span class="org-builtin">make</span>([]<span class="org-type">int</span>, 0, 10)  <span class="org-comment-delimiter">// </span><span class="org-comment">length 0, capacity 10
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Slicing operations
</span><span class="org-variable-name">slice</span> := []<span class="org-type">int</span>{0, 1, 2, 3, 4, 5}
slice[1:4]     <span class="org-comment-delimiter">// </span><span class="org-comment">[1 2 3] (index 1 to 3)
</span>slice[:3]      <span class="org-comment-delimiter">// </span><span class="org-comment">[0 1 2] (first 3)
</span>slice[3:]      <span class="org-comment-delimiter">// </span><span class="org-comment">[3 4 5] (from index 3)
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Copy slice
</span><span class="org-variable-name">src</span> := []<span class="org-type">int</span>{1, 2, 3}
<span class="org-variable-name">dst</span> := <span class="org-builtin">make</span>([]<span class="org-type">int</span>, <span class="org-builtin">len</span>(src))
<span class="org-builtin">copy</span>(dst, src)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf539c23" class="outline-3">
<h3 id="orgf539c23">Maps</h3>
<div class="outline-text-3" id="text-orgf539c23">
<p>
Key-value pairs. Essential for configs, caching, lookups.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-comment-delimiter">// </span><span class="org-comment">Create
</span><span class="org-variable-name">env</span> := <span class="org-builtin">make</span>(<span class="org-keyword">map</span>[<span class="org-type">string</span>]<span class="org-type">string</span>)
<span class="org-variable-name">env</span> := <span class="org-keyword">map</span>[<span class="org-type">string</span>]<span class="org-type">string</span>{
    <span class="org-string">"PATH"</span>: <span class="org-string">"/usr/bin"</span>,
    <span class="org-string">"HOME"</span>: <span class="org-string">"/root"</span>,
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Add/Update
</span>env[<span class="org-string">"USER"</span>] = <span class="org-string">"admin"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Check existence
</span><span class="org-variable-name">val</span>, <span class="org-variable-name">ok</span> := env[<span class="org-string">"USER"</span>]
<span class="org-keyword">if</span> ok {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Found:"</span>, val)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Delete
</span><span class="org-builtin">delete</span>(env, <span class="org-string">"USER"</span>)

<span class="org-comment-delimiter">// </span><span class="org-comment">Loop over map
</span><span class="org-keyword">for</span> <span class="org-variable-name">key</span>, <span class="org-variable-name">val</span> := <span class="org-keyword">range</span> env {
    fmt.<span class="org-function-name">Println</span>(key, <span class="org-string">"="</span>, val)
}

<span class="org-comment-delimiter">// </span><span class="org-comment">Map of structs
</span><span class="org-variable-name">users</span> := <span class="org-builtin">make</span>(<span class="org-keyword">map</span>[<span class="org-type">string</span>]<span class="org-type">User</span>)
users[<span class="org-string">"alice"</span>] = <span class="org-type">User</span>{<span class="org-constant">Name</span>: <span class="org-string">"Alice"</span>, <span class="org-constant">Age</span>: 30}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org327b49c" class="outline-2">
<h2 id="org327b49c">Formatting and Output</h2>
<div class="outline-text-2" id="text-org327b49c">
</div>
