roam/go-basics.org
** String Manipulation

#+begin_src go
import "strings"

// Split and join
parts := strings.Split("a,b,c", ",")           // []string{"a", "b", "c"}
joined := strings.Join([]string{"a", "b"}, "-") // "a-b"

// Check and search
strings.Contains("hello", "ell")      // true
strings.HasPrefix("hello", "he")     // true
strings.HasSuffix("hello", "lo")     // true
strings.Index("hello", "ll")         // 2

// Modify
strings.ToLower("HELLO")             // "hello"
strings.ToUpper("hello")             // "HELLO"
strings.TrimSpace("  hi  ")          // "hi"
strings.Trim("!!hello!!", "!")       // "hello"
strings.Replace("foo foo", "foo", "bar", 1)  // "bar foo" (replace 1)
strings.ReplaceAll("foo foo", "foo", "bar")  // "bar bar"

// Repeat and count
strings.Repeat("ha", 3)              // "hahaha"
strings.Count("cheese", "e")         // 3
#+end_src

** Printing
=fmt.Print= just print, =Println= new line, =Printf= formatted  

=fmt.Printf= prints a formatted string to stdout
=fmt.Sprintf= returns the formatted string

** Formatting Strings
This is like f string in python

#+begin_src go
  s := fmt.Sprintf("I am %v years old", 10) // %v is used for the default formats

  fmt.Sprintf("%[3]*.[2]*[1]f", 12.0, 2, 6) //equivalent to ("%6.2f", 12.0)
#+end_src

You can use other formats to be more specfic. =%s= for string, =%d= integer, =%.2f= float (2 decimal places), =%t= boolean, =%q= double quoted string, =%T= type of value, =%p= for pointers and slices, =%+v= struct with field names. 

Note: Use =%%= for percentage sign.

**** Printing Structs
#+begin_src go
  fmt.Printf("%v\n", u)   // {ekko 22}
  fmt.Printf("%+v\n", u)  // {Name:ekko Age:22}
  fmt.Printf("%#v\n", u)  // Go syntax
#+end_src

* Input and CLI

** Using fmt 

=fmt.Scan= takes input separted by spaces, =Scanln= by line, =Scanf= formatted scanning

#+begin_src go
var name string
var age int

fmt.Scanf("%s %d", &name, &age)
#+end_src

** Quick stdin read

#+begin_src go
import (
    "bufio"
    "os"
)

scanner := bufio.NewScanner(os.Stdin)

// scanner.Split(bufio.ScanWords) to split by words

for scanner.Scan() {
    line := scanner.Text()
    // process line
}

if err := scanner.Err(); err != nil {
    log.Fatal(err)
}
#+end_src

** String to Int
#+begin_src go
import "strconv"

numStr := scanner.Text()
num, err := strconv.Atoi(numStr)
if err != nil {
    log.Fatal("Invalid number:", err)
}
#+end_src

** Command-line Arguments

Good for cli tools.

#+begin_src go
import "os"

// os.Args is []string containing command-line arguments
if len(os.Args) < 2 {
    fmt.Println("Usage: program <arg>")
    return
}

// os.Args[0] is program name
// os.Args[1:] are actual arguments
for i, arg := range os.Args[1:] {
    fmt.Printf("Arg %d: %s\n", i, arg)
}
#+end_src

=go run main.go hello world=

| Index      | Value           |
|------------+-----------------|
| os.Args[0] | program name    |
| os.Args[1] | first argument  |
| os.Args[2] | second argument |


For real CLI tools, use the =flag= package:
#+begin_src go
import "flag"

var port = flag.Int("port", 8080, "server port")
var host = flag.String("host", "localhost", "server host")
flag.Parse()

fmt.Printf("Starting server on %s:%d\n", *host, *port)
// Run: go run main.go -port 3000 -host 0.0.0.0
#+end_src



* File I/O

