docs/go-basics.html
<div id="outline-container-org0677587" class="outline-3">
<h3 id="org0677587">String Manipulation</h3>
<div class="outline-text-3" id="text-org0677587">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"strings"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Split and join
</span><span class="org-variable-name">parts</span> := strings.<span class="org-function-name">Split</span>(<span class="org-string">"a,b,c"</span>, <span class="org-string">","</span>)           <span class="org-comment-delimiter">// </span><span class="org-comment">[]string{"a", "b", "c"}
</span><span class="org-variable-name">joined</span> := strings.<span class="org-function-name">Join</span>([]<span class="org-type">string</span>{<span class="org-string">"a"</span>, <span class="org-string">"b"</span>}, <span class="org-string">"-"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">"a-b"
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Check and search
</span>strings.<span class="org-function-name">Contains</span>(<span class="org-string">"hello"</span>, <span class="org-string">"ell"</span>)      <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>strings.<span class="org-function-name">HasPrefix</span>(<span class="org-string">"hello"</span>, <span class="org-string">"he"</span>)     <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>strings.<span class="org-function-name">HasSuffix</span>(<span class="org-string">"hello"</span>, <span class="org-string">"lo"</span>)     <span class="org-comment-delimiter">// </span><span class="org-comment">true
</span>strings.<span class="org-function-name">Index</span>(<span class="org-string">"hello"</span>, <span class="org-string">"ll"</span>)         <span class="org-comment-delimiter">// </span><span class="org-comment">2
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Modify
</span>strings.<span class="org-function-name">ToLower</span>(<span class="org-string">"HELLO"</span>)             <span class="org-comment-delimiter">// </span><span class="org-comment">"hello"
</span>strings.<span class="org-function-name">ToUpper</span>(<span class="org-string">"hello"</span>)             <span class="org-comment-delimiter">// </span><span class="org-comment">"HELLO"
</span>strings.<span class="org-function-name">TrimSpace</span>(<span class="org-string">"  hi  "</span>)          <span class="org-comment-delimiter">// </span><span class="org-comment">"hi"
</span>strings.<span class="org-function-name">Trim</span>(<span class="org-string">"!!hello!!"</span>, <span class="org-string">"!"</span>)       <span class="org-comment-delimiter">// </span><span class="org-comment">"hello"
</span>strings.<span class="org-function-name">Replace</span>(<span class="org-string">"foo foo"</span>, <span class="org-string">"foo"</span>, <span class="org-string">"bar"</span>, 1)  <span class="org-comment-delimiter">// </span><span class="org-comment">"bar foo" (replace 1)
</span>strings.<span class="org-function-name">ReplaceAll</span>(<span class="org-string">"foo foo"</span>, <span class="org-string">"foo"</span>, <span class="org-string">"bar"</span>)  <span class="org-comment-delimiter">// </span><span class="org-comment">"bar bar"
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Repeat and count
</span>strings.<span class="org-function-name">Repeat</span>(<span class="org-string">"ha"</span>, 3)              <span class="org-comment-delimiter">// </span><span class="org-comment">"hahaha"
</span>strings.<span class="org-function-name">Count</span>(<span class="org-string">"cheese"</span>, <span class="org-string">"e"</span>)         <span class="org-comment-delimiter">// </span><span class="org-comment">3</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd1196ac" class="outline-3">
<h3 id="orgd1196ac">Printing</h3>
<div class="outline-text-3" id="text-orgd1196ac">
<p>
<code>fmt.Print</code> just print, <code>Println</code> new line, <code>Printf</code> formatted  
</p>

<p>
<code>fmt.Printf</code> prints a formatted string to stdout
<code>fmt.Sprintf</code> returns the formatted string
</p>
</div>
</div>
<div id="outline-container-org3c88c97" class="outline-3">
<h3 id="org3c88c97">Formatting Strings</h3>
<div class="outline-text-3" id="text-org3c88c97">
<p>
This is like f string in python
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-variable-name">s</span> := fmt.<span class="org-function-name">Sprintf</span>(<span class="org-string">"I am %v years old"</span>, 10) <span class="org-comment-delimiter">// </span><span class="org-comment">%v is used for the default formats
</span>
fmt.<span class="org-function-name">Sprintf</span>(<span class="org-string">"%[3]*.[2]*[1]f"</span>, 12.0, 2, 6) <span class="org-comment-delimiter">//</span><span class="org-comment">equivalent to ("%6.2f", 12.0)</span>
</pre>
</div>

<p>
You can use other formats to be more specfic. <code>%s</code> for string, <code>%d</code> integer, <code>%.2f</code> float (2 decimal places), <code>%t</code> boolean, <code>%q</code> double quoted string, <code>%T</code> type of value, <code>%p</code> for pointers and slices, <code>%+v</code> struct with field names. 
</p>

<p>
Note: Use <code>%%</code> for percentage sign.
</p>
</div>
<div id="outline-container-org5e00aa0" class="outline-5">
<h5 id="org5e00aa0">Printing Structs</h5>
<div class="outline-text-5" id="text-org5e00aa0">
<div class="org-src-container">
<pre class="src src-go">fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%v\n"</span>, u)   <span class="org-comment-delimiter">// </span><span class="org-comment">{ekko 22}
</span>fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%+v\n"</span>, u)  <span class="org-comment-delimiter">// </span><span class="org-comment">{Name:ekko Age:22}
</span>fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"%#v\n"</span>, u)  <span class="org-comment-delimiter">// </span><span class="org-comment">Go syntax</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc324cc5" class="outline-2">
<h2 id="orgc324cc5">Input and CLI</h2>
<div class="outline-text-2" id="text-orgc324cc5">
</div>
<div id="outline-container-org44f863f" class="outline-3">
<h3 id="org44f863f">Using fmt</h3>
<div class="outline-text-3" id="text-org44f863f">
<p>
<code>fmt.Scan</code> takes input separted by spaces, <code>Scanln</code> by line, <code>Scanf</code> formatted scanning
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">var</span> <span class="org-variable-name">name</span> <span class="org-type">string</span>
<span class="org-keyword">var</span> <span class="org-variable-name">age</span> <span class="org-type">int</span>

fmt.<span class="org-function-name">Scanf</span>(<span class="org-string">"%s %d"</span>, &amp;name, &amp;age)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf10e220" class="outline-3">
<h3 id="orgf10e220">Quick stdin read</h3>
<div class="outline-text-3" id="text-orgf10e220">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> (
    <span class="org-string">"bufio"</span>
    <span class="org-string">"os"</span>
)

<span class="org-variable-name">scanner</span> := bufio.<span class="org-function-name">NewScanner</span>(os.Stdin)

<span class="org-comment-delimiter">// </span><span class="org-comment">scanner.Split(bufio.ScanWords) to split by words
</span>
<span class="org-keyword">for</span> scanner.<span class="org-function-name">Scan</span>() {
    <span class="org-variable-name">line</span> := scanner.<span class="org-function-name">Text</span>()
    <span class="org-comment-delimiter">// </span><span class="org-comment">process line
</span>}

<span class="org-keyword">if</span> <span class="org-variable-name">err</span> := scanner.<span class="org-function-name">Err</span>(); err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0777aac" class="outline-3">
<h3 id="org0777aac">String to Int</h3>
<div class="outline-text-3" id="text-org0777aac">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"strconv"</span>

<span class="org-variable-name">numStr</span> := scanner.<span class="org-function-name">Text</span>()
<span class="org-variable-name">num</span>, <span class="org-variable-name">err</span> := strconv.<span class="org-function-name">Atoi</span>(numStr)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(<span class="org-string">"Invalid number:"</span>, err)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org78813eb" class="outline-3">
<h3 id="org78813eb">Command-line Arguments</h3>
<div class="outline-text-3" id="text-org78813eb">
<p>
Good for cli tools.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"os"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">os.Args is []string containing command-line arguments
</span><span class="org-keyword">if</span> <span class="org-builtin">len</span>(os.Args) &lt; 2 {
    fmt.<span class="org-function-name">Println</span>(<span class="org-string">"Usage: program &lt;arg&gt;"</span>)
    <span class="org-keyword">return</span>
}

<span class="org-comment-delimiter">// </span><span class="org-comment">os.Args[0] is program name
</span><span class="org-comment-delimiter">// </span><span class="org-comment">os.Args[1:] are actual arguments
</span><span class="org-keyword">for</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">arg</span> := <span class="org-keyword">range</span> os.Args[1:] {
    fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"Arg %d: %s\n"</span>, i, arg)
}
</pre>
</div>

<p>
<code>go run main.go hello world</code>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Index</th>
<th scope="col" class="org-left">Value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">os.Args[0]</td>
<td class="org-left">program name</td>
</tr>

<tr>
<td class="org-left">os.Args[1]</td>
<td class="org-left">first argument</td>
</tr>

<tr>
<td class="org-left">os.Args[2]</td>
<td class="org-left">second argument</td>
</tr>
</tbody>
</table>


<p>
For real CLI tools, use the <code>flag</code> package:
</p>
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"flag"</span>

<span class="org-keyword">var</span> <span class="org-variable-name">port</span> = flag.<span class="org-function-name">Int</span>(<span class="org-string">"port"</span>, 8080, <span class="org-string">"server port"</span>)
<span class="org-keyword">var</span> <span class="org-variable-name">host</span> = flag.<span class="org-function-name">String</span>(<span class="org-string">"host"</span>, <span class="org-string">"localhost"</span>, <span class="org-string">"server host"</span>)
flag.<span class="org-function-name">Parse</span>()

fmt.<span class="org-function-name">Printf</span>(<span class="org-string">"Starting server on %s:%d\n"</span>, *host, *port)
<span class="org-comment-delimiter">// </span><span class="org-comment">Run: go run main.go -port 3000 -host 0.0.0.0</span>
</pre>
</div>
</div>
</div>
</div>
