roam/go-basics.org
** Reading from file
A file is just a stream of bytes you can read from or write to.


#+begin_src go
package main

import (
	"fmt"
	"os"
)

func main() {
	file, err := os.Open("data.txt")
	if err != nil {
		log.Fatal(err)
	}
	defer file.Close()

	fmt.Println("File opened:", file.Name())
}
#+end_src

** Read entire file at once

#+begin_src go
data, err := os.ReadFile("data.txt")  // Returns []byte
if err != nil {
    log.Fatal(err)
}
fmt.Println(string(data))
#+end_src

** Read line by line from a file

#+begin_src go
package main

import (
	"bufio"
	"fmt"
	"os"
)

func main() {
	file, err := os.Open("data.txt")
	if err != nil {
		log.Fatal(err)
	}
	defer file.Close()

	scanner := bufio.NewScanner(file)

	for scanner.Scan() {
		line := scanner.Text()
		fmt.Println(line)
	}

	if err := scanner.Err(); err != nil {
		log.Fatal(err)
	}
}
#+end_src

** Writing to file

#+begin_src go
package main

import (
	"os"
)

func main() {
	data := []byte("hello world\n")

	err := os.WriteFile("data.txt", data, 0644)  //creates file if not exists, overwrites if exists
	if err != nil {
		log.Fatal(err)
	}
}
#+end_src

Permissions 0644:
- owner: read/write
- others: read

** Append to file

#+begin_src go
file, err := os.OpenFile("data.txt",
	os.O_APPEND|os.O_CREATE|os.O_WRONLY,
	0644,
)
if err != nil {
	log.Fatal(err)
}
defer file.Close()

file.WriteString("new line\n")
#+end_src

Flags
- =O_APPEND=:  add to end
- =O_CREATE=:  create if missing
- =O_WRONLY=:  write only

** Buffered Write

#+begin_src go
package main

import (
	"bufio"
	"os"
)

func main() {
	file, _ := os.Create("data.txt")
	defer file.Close()

	writer := bufio.NewWriter(file)

	writer.WriteString("hello\n")
	writer.WriteString("world\n")

	writer.Flush()  // Important: flush buffer to disk
}
#+end_src

Without buffer every write will call disk (slow), with buffer, it collects data and writes in chunks (fast)


* JSON

Essential for config files, APIs, data exchange.

#+begin_src go
import "encoding/json"

type Config struct {
    Host    string `json:"host"`
    Port    int    `json:"port"`
    Debug   bool   `json:"debug,omitempty"`  // Omit if false
    Timeout int    `json:"-"`                // Never serialize
}

// Parse JSON (Unmarshal)
data := []byte(`{"host":"localhost","port":8080,"debug":true}`)
var cfg Config
err := json.Unmarshal(data, &cfg)
if err != nil {
    log.Fatal(err)
}
fmt.Println(cfg.Host, cfg.Port)

// Create JSON (Marshal)
cfg := Config{Host: "0.0.0.0", Port: 3000, Debug: true}

// Compact
bytes, _ := json.Marshal(cfg)
fmt.Println(string(bytes))

// Pretty print
bytes, _ = json.MarshalIndent(cfg, "", "  ")
fmt.Println(string(bytes))

// Working with files
data, _ := os.ReadFile("config.json")
json.Unmarshal(data, &cfg)

bytes, _ := json.MarshalIndent(cfg, "", "  ")
os.WriteFile("config.json", bytes, 0644)

// Dynamic JSON (map)
var result map[string]interface{}
json.Unmarshal(data, &result)
fmt.Println(result["host"])
#+end_src



