docs/go-basics.html
<div id="outline-container-orgee39bdc" class="outline-2">
<h2 id="orgee39bdc">File I/O</h2>
<div class="outline-text-2" id="text-orgee39bdc">
</div>
<div id="outline-container-orgdb7a18d" class="outline-3">
<h3 id="orgdb7a18d">Reading from file</h3>
<div class="outline-text-3" id="text-orgdb7a18d">
<p>
A file is just a stream of bytes you can read from or write to.
</p>


<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> (
        <span class="org-string">"fmt"</span>
        <span class="org-string">"os"</span>
)

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
        <span class="org-variable-name">file</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">Open</span>(<span class="org-string">"data.txt"</span>)
        <span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
                log.<span class="org-function-name">Fatal</span>(err)
        }
        <span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()

        fmt.<span class="org-function-name">Println</span>(<span class="org-string">"File opened:"</span>, file.<span class="org-function-name">Name</span>())
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org03e05f0" class="outline-3">
<h3 id="org03e05f0">Read entire file at once</h3>
<div class="outline-text-3" id="text-org03e05f0">
<div class="org-src-container">
<pre class="src src-go"><span class="org-variable-name">data</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">ReadFile</span>(<span class="org-string">"data.txt"</span>)  <span class="org-comment-delimiter">// </span><span class="org-comment">Returns []byte
</span><span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}
fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">string</span>(data))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgda57442" class="outline-3">
<h3 id="orgda57442">Read line by line from a file</h3>
<div class="outline-text-3" id="text-orgda57442">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> (
        <span class="org-string">"bufio"</span>
        <span class="org-string">"fmt"</span>
        <span class="org-string">"os"</span>
)

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
        <span class="org-variable-name">file</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">Open</span>(<span class="org-string">"data.txt"</span>)
        <span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
                log.<span class="org-function-name">Fatal</span>(err)
        }
        <span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()

        <span class="org-variable-name">scanner</span> := bufio.<span class="org-function-name">NewScanner</span>(file)

        <span class="org-keyword">for</span> scanner.<span class="org-function-name">Scan</span>() {
                <span class="org-variable-name">line</span> := scanner.<span class="org-function-name">Text</span>()
                fmt.<span class="org-function-name">Println</span>(line)
        }

        <span class="org-keyword">if</span> <span class="org-variable-name">err</span> := scanner.<span class="org-function-name">Err</span>(); err != <span class="org-constant">nil</span> {
                log.<span class="org-function-name">Fatal</span>(err)
        }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org11f357d" class="outline-3">
<h3 id="org11f357d">Writing to file</h3>
<div class="outline-text-3" id="text-org11f357d">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> (
        <span class="org-string">"os"</span>
)

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
        <span class="org-variable-name">data</span> := []<span class="org-function-name">byte</span>(<span class="org-string">"hello world\n"</span>)

        <span class="org-variable-name">err</span> := os.<span class="org-function-name">WriteFile</span>(<span class="org-string">"data.txt"</span>, data, 0644)  <span class="org-comment-delimiter">//</span><span class="org-comment">creates file if not exists, overwrites if exists
</span>        <span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
                log.<span class="org-function-name">Fatal</span>(err)
        }
}
</pre>
</div>

<p>
Permissions 0644:
</p>
<ul class="org-ul">
<li>owner: read/write</li>
<li>others: read</li>
</ul>
</div>
</div>
<div id="outline-container-org8122976" class="outline-3">
<h3 id="org8122976">Append to file</h3>
<div class="outline-text-3" id="text-org8122976">
<div class="org-src-container">
<pre class="src src-go"><span class="org-variable-name">file</span>, <span class="org-variable-name">err</span> := os.<span class="org-function-name">OpenFile</span>(<span class="org-string">"data.txt"</span>,
        os.O_APPEND|os.O_CREATE|os.O_WRONLY,
        0644,
)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
        log.<span class="org-function-name">Fatal</span>(err)
}
<span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()

file.<span class="org-function-name">WriteString</span>(<span class="org-string">"new line\n"</span>)
</pre>
</div>

<p>
Flags
</p>
<ul class="org-ul">
<li><code>O_APPEND</code>:  add to end</li>
<li><code>O_CREATE</code>:  create if missing</li>
<li><code>O_WRONLY</code>:  write only</li>
</ul>
</div>
</div>
<div id="outline-container-org36e6be3" class="outline-3">
<h3 id="org36e6be3">Buffered Write</h3>
<div class="outline-text-3" id="text-org36e6be3">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">package</span> main

<span class="org-keyword">import</span> (
        <span class="org-string">"bufio"</span>
        <span class="org-string">"os"</span>
)

<span class="org-keyword">func</span> <span class="org-function-name">main</span>() {
        <span class="org-variable-name">file</span>, <span class="org-variable-name">_</span> := os.<span class="org-function-name">Create</span>(<span class="org-string">"data.txt"</span>)
        <span class="org-keyword">defer</span> file.<span class="org-function-name">Close</span>()

        <span class="org-variable-name">writer</span> := bufio.<span class="org-function-name">NewWriter</span>(file)

        writer.<span class="org-function-name">WriteString</span>(<span class="org-string">"hello\n"</span>)
        writer.<span class="org-function-name">WriteString</span>(<span class="org-string">"world\n"</span>)

        writer.<span class="org-function-name">Flush</span>()  <span class="org-comment-delimiter">// </span><span class="org-comment">Important: flush buffer to disk
</span>}
</pre>
</div>

<p>
Without buffer every write will call disk (slow), with buffer, it collects data and writes in chunks (fast)
</p>
</div>
</div>
</div>
<div id="outline-container-org8d2a0c6" class="outline-2">
<h2 id="org8d2a0c6">JSON</h2>
<div class="outline-text-2" id="text-org8d2a0c6">
<p>
Essential for config files, APIs, data exchange.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"encoding/json"</span>

<span class="org-keyword">type</span> <span class="org-type">Config</span> <span class="org-keyword">struct</span> {
    Host    <span class="org-type">string</span> <span class="org-string">`json:"host"`</span>
    Port    <span class="org-type">int</span>    <span class="org-string">`json:"port"`</span>
    Debug   <span class="org-type">bool</span>   <span class="org-string">`json:"debug,omitempty"`</span>  <span class="org-comment-delimiter">// </span><span class="org-comment">Omit if false
</span>    Timeout <span class="org-type">int</span>    <span class="org-string">`json:"-"`</span>                <span class="org-comment-delimiter">// </span><span class="org-comment">Never serialize
</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Parse JSON (Unmarshal)
</span><span class="org-variable-name">data</span> := []<span class="org-function-name">byte</span>(<span class="org-string">`{"host":"localhost","port":8080,"debug":true}`</span>)
<span class="org-keyword">var</span> <span class="org-variable-name">cfg</span> <span class="org-type">Config</span>
<span class="org-variable-name">err</span> := json.<span class="org-function-name">Unmarshal</span>(data, &amp;cfg)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}
fmt.<span class="org-function-name">Println</span>(cfg.Host, cfg.Port)

<span class="org-comment-delimiter">// </span><span class="org-comment">Create JSON (Marshal)
</span><span class="org-variable-name">cfg</span> := <span class="org-type">Config</span>{<span class="org-constant">Host</span>: <span class="org-string">"0.0.0.0"</span>, <span class="org-constant">Port</span>: 3000, <span class="org-constant">Debug</span>: <span class="org-constant">true</span>}

<span class="org-comment-delimiter">// </span><span class="org-comment">Compact
</span><span class="org-variable-name">bytes</span>, <span class="org-variable-name">_</span> := json.<span class="org-function-name">Marshal</span>(cfg)
fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">string</span>(bytes))

<span class="org-comment-delimiter">// </span><span class="org-comment">Pretty print
</span>bytes, _ = json.<span class="org-function-name">MarshalIndent</span>(cfg, <span class="org-string">""</span>, <span class="org-string">"  "</span>)
fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">string</span>(bytes))

<span class="org-comment-delimiter">// </span><span class="org-comment">Working with files
</span><span class="org-variable-name">data</span>, <span class="org-variable-name">_</span> := os.<span class="org-function-name">ReadFile</span>(<span class="org-string">"config.json"</span>)
json.<span class="org-function-name">Unmarshal</span>(data, &amp;cfg)

<span class="org-variable-name">bytes</span>, <span class="org-variable-name">_</span> := json.<span class="org-function-name">MarshalIndent</span>(cfg, <span class="org-string">""</span>, <span class="org-string">"  "</span>)
os.<span class="org-function-name">WriteFile</span>(<span class="org-string">"config.json"</span>, bytes, 0644)

<span class="org-comment-delimiter">// </span><span class="org-comment">Dynamic JSON (map)
</span><span class="org-keyword">var</span> <span class="org-variable-name">result</span> <span class="org-keyword">map</span>[<span class="org-type">string</span>]<span class="org-keyword">interface</span>{}
json.<span class="org-function-name">Unmarshal</span>(data, &amp;result)
fmt.<span class="org-function-name">Println</span>(result[<span class="org-string">"host"</span>])
</pre>
</div>
</div>
</div>
