roam/go-basics.org
* Running external commands

Running shell commands and external programs.

#+begin_src go
import "os/exec"

// Simple command
cmd := exec.Command("ls", "-la")
output, err := cmd.Output()
if err != nil {
    log.Fatal(err)
}
fmt.Println(string(output))

// Command with combined stdout/stderr
cmd := exec.Command("git", "status")
output, err := cmd.CombinedOutput()

// Pipe stdin to command
cmd := exec.Command("grep", "error")
cmd.Stdin = strings.NewReader("info\nerror\nwarning\nerror\n")
output, _ := cmd.Output()
fmt.Println(string(output))  // error\nerror\n

// Set working directory and environment
cmd := exec.Command("ls")
cmd.Dir = "/tmp"
cmd.Env = append(os.Environ(), "DEBUG=1")
cmd.Run()

// Stream output in real-time
cmd := exec.Command("ping", "google.com")
cmd.Stdout = os.Stdout
cmd.Stderr = os.Stderr
cmd.Run()
#+end_src

* Some Standard Library Packages  

** time

#+begin_src go
import "time"

// Current time
now := time.Now()
fmt.Println(now)

// Format time (specific layout)
fmt.Println(now.Format("2006-01-02 15:04:05"))  // YYYY-MM-DD HH:MM:SS
fmt.Println(now.Format(time.RFC3339))           // 2024-01-15T14:30:00Z

// Parse time
t, _ := time.Parse("2006-01-02", "2024-01-15")

// Duration
time.Sleep(2 * time.Second)
duration := 5 * time.Minute

// Add/Sub time
tomorrow := now.Add(24 * time.Hour)
yesterday := now.Add(-24 * time.Hour)

// Compare
if now.After(t) { }
if now.Before(t) { }
#+end_src

** filepath

#+begin_src go
import "path/filepath"

// Join paths (OS-specific separator)
path := filepath.Join("dir", "subdir", "file.txt")

// Get directory and filename
dir := filepath.Dir("/home/user/file.txt")   // /home/user
file := filepath.Base("/home/user/file.txt") // file.txt

// Extension
ext := filepath.Ext("file.txt")  // .txt

// Absolute path
abs, _ := filepath.Abs("../file.txt")

// Walk directory tree
filepath.Walk(".", func(path string, info os.FileInfo, err error) error {
    if !info.IsDir() {
        fmt.Println(path)
    }
    return nil
})
#+end_src

** net/http (Quick HTTP server)

#+begin_src go
import "net/http"

// Simple server
http.HandleFunc("/", func(w http.ResponseWriter, r *http.Request) {
    fmt.Fprintf(w, "Hello, World!")
})
log.Fatal(http.ListenAndServe(":8080", nil))

// HTTP request
resp, err := http.Get("https://api.github.com")
if err != nil {
    log.Fatal(err)
}
defer resp.Body.Close()
body, _ := io.ReadAll(resp.Body)
#+end_src
