docs/go-basics.html
<div id="outline-container-org917b881" class="outline-2">
<h2 id="org917b881">Running external commands</h2>
<div class="outline-text-2" id="text-org917b881">
<p>
Running shell commands and external programs.
</p>

<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"os/exec"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Simple command
</span><span class="org-variable-name">cmd</span> := exec.<span class="org-function-name">Command</span>(<span class="org-string">"ls"</span>, <span class="org-string">"-la"</span>)
<span class="org-variable-name">output</span>, <span class="org-variable-name">err</span> := cmd.<span class="org-function-name">Output</span>()
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}
fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">string</span>(output))

<span class="org-comment-delimiter">// </span><span class="org-comment">Command with combined stdout/stderr
</span><span class="org-variable-name">cmd</span> := exec.<span class="org-function-name">Command</span>(<span class="org-string">"git"</span>, <span class="org-string">"status"</span>)
<span class="org-variable-name">output</span>, <span class="org-variable-name">err</span> := cmd.<span class="org-function-name">CombinedOutput</span>()

<span class="org-comment-delimiter">// </span><span class="org-comment">Pipe stdin to command
</span><span class="org-variable-name">cmd</span> := exec.<span class="org-function-name">Command</span>(<span class="org-string">"grep"</span>, <span class="org-string">"error"</span>)
cmd.Stdin = strings.<span class="org-function-name">NewReader</span>(<span class="org-string">"info\nerror\nwarning\nerror\n"</span>)
<span class="org-variable-name">output</span>, <span class="org-variable-name">_</span> := cmd.<span class="org-function-name">Output</span>()
fmt.<span class="org-function-name">Println</span>(<span class="org-function-name">string</span>(output))  <span class="org-comment-delimiter">// </span><span class="org-comment">error\nerror\n
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Set working directory and environment
</span><span class="org-variable-name">cmd</span> := exec.<span class="org-function-name">Command</span>(<span class="org-string">"ls"</span>)
cmd.Dir = <span class="org-string">"/tmp"</span>
cmd.Env = <span class="org-builtin">append</span>(os.<span class="org-function-name">Environ</span>(), <span class="org-string">"DEBUG=1"</span>)
cmd.<span class="org-function-name">Run</span>()

<span class="org-comment-delimiter">// </span><span class="org-comment">Stream output in real-time
</span><span class="org-variable-name">cmd</span> := exec.<span class="org-function-name">Command</span>(<span class="org-string">"ping"</span>, <span class="org-string">"google.com"</span>)
cmd.Stdout = os.Stdout
cmd.Stderr = os.Stderr
cmd.<span class="org-function-name">Run</span>()
</pre>
</div>
</div>
</div>
<div id="outline-container-org682abc8" class="outline-2">
<h2 id="org682abc8">Some Standard Library Packages</h2>
<div class="outline-text-2" id="text-org682abc8">
</div>
<div id="outline-container-org16f915f" class="outline-3">
<h3 id="org16f915f">time</h3>
<div class="outline-text-3" id="text-org16f915f">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"time"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Current time
</span><span class="org-variable-name">now</span> := time.<span class="org-function-name">Now</span>()
fmt.<span class="org-function-name">Println</span>(now)

<span class="org-comment-delimiter">// </span><span class="org-comment">Format time (specific layout)
</span>fmt.<span class="org-function-name">Println</span>(now.<span class="org-function-name">Format</span>(<span class="org-string">"2006-01-02 15:04:05"</span>))  <span class="org-comment-delimiter">// </span><span class="org-comment">YYYY-MM-DD HH:MM:SS
</span>fmt.<span class="org-function-name">Println</span>(now.<span class="org-function-name">Format</span>(time.RFC3339))           <span class="org-comment-delimiter">// </span><span class="org-comment">2024-01-15T14:30:00Z
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Parse time
</span><span class="org-variable-name">t</span>, <span class="org-variable-name">_</span> := time.<span class="org-function-name">Parse</span>(<span class="org-string">"2006-01-02"</span>, <span class="org-string">"2024-01-15"</span>)

<span class="org-comment-delimiter">// </span><span class="org-comment">Duration
</span>time.<span class="org-function-name">Sleep</span>(2 * time.Second)
<span class="org-variable-name">duration</span> := 5 * time.Minute

<span class="org-comment-delimiter">// </span><span class="org-comment">Add/Sub time
</span><span class="org-variable-name">tomorrow</span> := now.<span class="org-function-name">Add</span>(24 * time.Hour)
<span class="org-variable-name">yesterday</span> := now.<span class="org-function-name">Add</span>(-24 * time.Hour)

<span class="org-comment-delimiter">// </span><span class="org-comment">Compare
</span><span class="org-keyword">if</span> now.<span class="org-function-name">After</span>(t) { }
<span class="org-keyword">if</span> now.<span class="org-function-name">Before</span>(t) { }
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e0f95a" class="outline-3">
<h3 id="org3e0f95a">filepath</h3>
<div class="outline-text-3" id="text-org3e0f95a">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"path/filepath"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Join paths (OS-specific separator)
</span><span class="org-variable-name">path</span> := filepath.<span class="org-function-name">Join</span>(<span class="org-string">"dir"</span>, <span class="org-string">"subdir"</span>, <span class="org-string">"file.txt"</span>)

<span class="org-comment-delimiter">// </span><span class="org-comment">Get directory and filename
</span><span class="org-variable-name">dir</span> := filepath.<span class="org-function-name">Dir</span>(<span class="org-string">"/home/user/file.txt"</span>)   <span class="org-comment-delimiter">// </span><span class="org-comment">/home/user
</span><span class="org-variable-name">file</span> := filepath.<span class="org-function-name">Base</span>(<span class="org-string">"/home/user/file.txt"</span>) <span class="org-comment-delimiter">// </span><span class="org-comment">file.txt
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Extension
</span><span class="org-variable-name">ext</span> := filepath.<span class="org-function-name">Ext</span>(<span class="org-string">"file.txt"</span>)  <span class="org-comment-delimiter">// </span><span class="org-comment">.txt
</span>
<span class="org-comment-delimiter">// </span><span class="org-comment">Absolute path
</span><span class="org-variable-name">abs</span>, <span class="org-variable-name">_</span> := filepath.<span class="org-function-name">Abs</span>(<span class="org-string">"../file.txt"</span>)

<span class="org-comment-delimiter">// </span><span class="org-comment">Walk directory tree
</span>filepath.<span class="org-function-name">Walk</span>(<span class="org-string">"."</span>, <span class="org-keyword">func</span>(<span class="org-variable-name">path</span> <span class="org-type">string</span>, <span class="org-variable-name">info</span> <span class="org-type">os.FileInfo</span>, <span class="org-variable-name">err</span> <span class="org-type">error</span>) <span class="org-type">error</span> {
    <span class="org-keyword">if</span> <span class="org-negation-char">!</span>info.<span class="org-function-name">IsDir</span>() {
        fmt.<span class="org-function-name">Println</span>(path)
    }
    <span class="org-keyword">return</span> <span class="org-constant">nil</span>
})
</pre>
</div>
</div>
</div>
<div id="outline-container-orga4fbecf" class="outline-3">
<h3 id="orga4fbecf">net/http (Quick HTTP server)</h3>
<div class="outline-text-3" id="text-orga4fbecf">
<div class="org-src-container">
<pre class="src src-go"><span class="org-keyword">import</span> <span class="org-string">"net/http"</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Simple server
</span>http.<span class="org-function-name">HandleFunc</span>(<span class="org-string">"/"</span>, <span class="org-keyword">func</span>(<span class="org-variable-name">w</span> <span class="org-type">http.ResponseWriter</span>, <span class="org-variable-name">r</span> *<span class="org-type">http.Request</span>) {
    fmt.<span class="org-function-name">Fprintf</span>(w, <span class="org-string">"Hello, World!"</span>)
})
log.<span class="org-function-name">Fatal</span>(http.<span class="org-function-name">ListenAndServe</span>(<span class="org-string">":8080"</span>, <span class="org-constant">nil</span>))

<span class="org-comment-delimiter">// </span><span class="org-comment">HTTP request
</span><span class="org-variable-name">resp</span>, <span class="org-variable-name">err</span> := http.<span class="org-function-name">Get</span>(<span class="org-string">"https://api.github.com"</span>)
<span class="org-keyword">if</span> err != <span class="org-constant">nil</span> {
    log.<span class="org-function-name">Fatal</span>(err)
}
<span class="org-keyword">defer</span> resp.Body.<span class="org-function-name">Close</span>()
<span class="org-variable-name">body</span>, <span class="org-variable-name">_</span> := io.<span class="org-function-name">ReadAll</span>(resp.Body)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="footer">Built with Emacs</p>
</div>
</body>
</html>
